// Online C compiler to run C program online
#include <stdio.h>

int main() {
    int list[100] = {64, 37, 31, 11, 16, 60, 26, 81, 89, 20, 39, 49, 78, 13, 61, 78, 21, 34, 99, 98,87, 14, 50, 75, 75, 62, 14, 58, 59, 86, 78, 22, 89, 8, 100, 4, 34, 92, 86, 23,11, 91, 72, 56, 71, 33, 100, 92, 33, 99, 89, 86, 79, 4, 26, 19, 32, 40, 44, 57,25, 21, 46, 81, 29, 45, 85, 29, 37, 36, 52, 14, 27, 91, 70, 98, 23, 70, 55, 22, 34, 9, 8, 12, 80, 34, 31, 78, 75, 75, 35, 66, 62, 81, 46, 57, 92, 98, 87, 95};
    int i;
    int num[101]={0};
    int count=0;
    //숫자 저장하고,겹치면 넘어가기.
    //카운트해주기
    for(i=0; i<100; i++){
        if(num[list[i]] == 0){//0이면 처음이라고 할 수 있다 왜냐면 
            count++;
            num[list[i]]=1; //밑에서 이미 나왔던거는 1로 바꿔줬으니까
        }
    }
    printf("%d\n", count);
    

    return 0;
}
